{"backend": "tensorflow", "config": {"name": "sequential_5", "layers": [{"config": {"data_format": "channels_last", "bias_constraint": null, "dtype": "float32", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "name": "conv0", "filters": 8, "kernel_constraint": null, "bias_regularizer": null, "kernel_size": [5, 5], "activation": "linear", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "strides": [1, 1], "activity_regularizer": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "padding": "valid"}, "class_name": "Conv2D"}, {"config": {"name": "activation_21", "dtype": "float32", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"data_format": "channels_last", "trainable": true, "name": "max_pooling2d_13", "strides": [5, 5], "padding": "valid", "dtype": "float32", "pool_size": [5, 5]}, "class_name": "MaxPooling2D"}, {"config": {"data_format": "channels_last", "bias_constraint": null, "dtype": "float32", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "name": "conv2d_17", "filters": 16, "kernel_constraint": null, "bias_regularizer": null, "kernel_size": [2, 2], "activation": "linear", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "strides": [1, 1], "activity_regularizer": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "padding": "same"}, "class_name": "Conv2D"}, {"config": {"name": "activation_22", "dtype": "float32", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"data_format": "channels_last", "bias_constraint": null, "dtype": "float32", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "name": "conv2d_18", "filters": 32, "kernel_constraint": null, "bias_regularizer": null, "kernel_size": [2, 2], "activation": "linear", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "strides": [1, 1], "activity_regularizer": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "padding": "same"}, "class_name": "Conv2D"}, {"config": {"name": "activation_23", "dtype": "float32", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"data_format": "channels_last", "bias_constraint": null, "dtype": "float32", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "name": "conv2d_19", "filters": 64, "kernel_constraint": null, "bias_regularizer": null, "kernel_size": [2, 2], "activation": "linear", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "strides": [1, 1], "activity_regularizer": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "padding": "same"}, "class_name": "Conv2D"}, {"config": {"name": "activation_24", "dtype": "float32", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"data_format": "channels_last", "trainable": true, "name": "max_pooling2d_14", "strides": [2, 2], "padding": "valid", "dtype": "float32", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"data_format": "channels_last", "bias_constraint": null, "dtype": "float32", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "name": "conv2d_20", "filters": 128, "kernel_constraint": null, "bias_regularizer": null, "kernel_size": [2, 2], "activation": "linear", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "strides": [1, 1], "activity_regularizer": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "padding": "same"}, "class_name": "Conv2D"}, {"config": {"name": "activation_25", "dtype": "float32", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"data_format": "channels_last", "trainable": true, "name": "max_pooling2d_15", "strides": [4, 4], "padding": "valid", "dtype": "float32", "pool_size": [4, 4]}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_5", "data_format": "channels_last", "dtype": "float32", "trainable": true}, "class_name": "Flatten"}, {"config": {"bias_constraint": null, "dtype": "float32", "units": 5, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "name": "dense_5", "kernel_constraint": null, "bias_regularizer": null, "activation": "softmax", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "activity_regularizer": null, "kernel_regularizer": null}, "class_name": "Dense"}]}, "keras_version": "2.2.5", "class_name": "Sequential"}