{"config": {"name": "sequential_5", "layers": [{"config": {"dtype": "float32", "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "padding": "valid", "dilation_rate": [1, 1], "activation": "linear", "filters": 8, "kernel_regularizer": null, "name": "conv0", "strides": [1, 1], "bias_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": true, "kernel_size": [5, 5], "kernel_constraint": null, "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"dtype": "float32", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "beta_constraint": null, "gamma_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "name": "bn1", "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 1e-05, "axis": 1, "momentum": 0.99, "trainable": true, "center": true, "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"config": {"dtype": "float32", "name": "activation_21", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"dtype": "float32", "name": "max_pooling2d_13", "strides": [5, 5], "pool_size": [5, 5], "data_format": "channels_last", "padding": "valid", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"dtype": "float32", "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "padding": "same", "dilation_rate": [1, 1], "activation": "linear", "filters": 16, "kernel_regularizer": null, "name": "conv2d_17", "strides": [1, 1], "bias_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": true, "kernel_size": [2, 2], "kernel_constraint": null, "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"dtype": "float32", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "beta_constraint": null, "gamma_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "name": "bn2", "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 1e-05, "axis": 1, "momentum": 0.99, "trainable": true, "center": true, "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"config": {"dtype": "float32", "name": "activation_22", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"dtype": "float32", "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "padding": "same", "dilation_rate": [1, 1], "activation": "linear", "filters": 32, "kernel_regularizer": null, "name": "conv2d_18", "strides": [1, 1], "bias_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": true, "kernel_size": [2, 2], "kernel_constraint": null, "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"dtype": "float32", "name": "activation_23", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"dtype": "float32", "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "padding": "same", "dilation_rate": [1, 1], "activation": "linear", "filters": 64, "kernel_regularizer": null, "name": "conv2d_19", "strides": [1, 1], "bias_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": true, "kernel_size": [2, 2], "kernel_constraint": null, "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"dtype": "float32", "name": "activation_24", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"dtype": "float32", "name": "max_pooling2d_14", "strides": [2, 2], "pool_size": [2, 2], "data_format": "channels_last", "padding": "valid", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"dtype": "float32", "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "padding": "same", "dilation_rate": [1, 1], "activation": "linear", "filters": 128, "kernel_regularizer": null, "name": "conv2d_20", "strides": [1, 1], "bias_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": true, "kernel_size": [2, 2], "kernel_constraint": null, "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"dtype": "float32", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "beta_constraint": null, "gamma_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "name": "bn3", "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 1e-05, "axis": 1, "momentum": 0.99, "trainable": true, "center": true, "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"config": {"dtype": "float32", "name": "activation_25", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"dtype": "float32", "name": "max_pooling2d_15", "strides": [4, 4], "pool_size": [4, 4], "data_format": "channels_last", "padding": "valid", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"dtype": "float32", "name": "flatten_5", "trainable": true, "data_format": "channels_last"}, "class_name": "Flatten"}, {"config": {"dtype": "float32", "units": 128, "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "name": "fc", "use_bias": true, "trainable": true, "activation": "relu", "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"dtype": "float32", "units": 5, "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "name": "dense_5", "use_bias": true, "trainable": true, "activation": "softmax", "activity_regularizer": null}, "class_name": "Dense"}]}, "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.2.5"}